PKS1C/src/Reports/ОтчетПоДоговорам/ОтчетПоДоговорам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчетПоДоговорам</name>
</mdclass:Report>

PKS1C/src/InformationRegisters/ДоговораОбслуживания/ДоговораОбслуживания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДоговораОбслуживания</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>АбонентскаяПлата</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Тариф</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТарифСверхурочный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ЧерныйСписок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

PKS1C/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <comment>Реквизит введен для совместимости с Библиотекой типов и не выводится в пользовательский интерфейс. Заполняется автоматически по данным реквизита ЮрФизЛицо.</comment>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоловнойКонтрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <type>
      <types>EnumRef.ЮрФизЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>НДСПоСтавкам4и2</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаРегистрации</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НалоговыйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеМеждународное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>ДействуетС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияКПП</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КПП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияНаименований</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеПолное</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

PKS1C/src/Reports/ОтчетПоДоговорам/Forms/ФормаОтчета/Module.bsl
&НаКлиенте
Процедура МесяцНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЭтаФорма.Месяц = ОткрытьФормуМодально("Обработка.ВыпадающийВыборПериода.Форма.Форма2"); 
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере(Месяц)
	Макет = Отчеты.ОтчетПоДоговорам.ПолучитьМакет("Макет");
	ОбластьПараметры = Макет.ПолучитьОбласть("Параметры");	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");	
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	ОбластьПараметры.Параметры.Месяц = Формат(Месяц, "ДФ=""ММ.гггг""");
	
	ТабДок = Новый ТабличныйДокумент;
	
	ТабДок.Вывести(ОбластьПараметры);
	ТабДок.Вывести(ОбластьШапка);
	
	ЗапросДоговоров = Новый Запрос;
	ЗапросДоговоров.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Контрагенты.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТКонтрагенты
		|ИЗ
		|	Справочник.Клиенты КАК Клиенты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
		|		ПО Клиенты.Контрагент = Контрагенты.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоговораОбслуживанияСрезПоследних.Контрагент КАК Контрагент,
		|	ДоговораОбслуживанияСрезПоследних.Период КАК Дата,
		|	ДоговораОбслуживанияСрезПоследних.Период КАК Период,
		|	ДоговораОбслуживанияСрезПоследних.Регистратор КАК Регистратор,
		|	ДоговораОбслуживанияСрезПоследних.АбонентскаяПлата КАК АбонентскаяПлата,
		|	ДоговораОбслуживанияСрезПоследних.Тариф КАК Тариф,
		|	ДоговораОбслуживанияСрезПоследних.ТарифСверхурочный КАК ТарифСверхурочный
		|ПОМЕСТИТЬ ВТДаты
		|ИЗ
		|	РегистрСведений.ДоговораОбслуживания.СрезПоследних(
		|			&Дата,
		|			(СрокДействия > &Дата
		|				ИЛИ СрокДействия = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
		|				И НЕ ЧерныйСписок) КАК ДоговораОбслуживанияСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДоговораОбслуживания.СрезПоследних(&Дата, ) КАК ДоговораОбслуживанияСрезПоследних1
		|		ПО ДоговораОбслуживанияСрезПоследних.Регистратор = ДоговораОбслуживанияСрезПоследних1.Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЕСТЬNULL(ВТДаты.АбонентскаяПлата, ЛОЖЬ) КАК АбонентскаяПлата,
		|	ЕСТЬNULL(ВТДаты.Тариф, 0) КАК Тариф,
		|	ЕСТЬNULL(ВТДаты.ТарифСверхурочный, 0) КАК ТарифСверхурочный,
		|	ЕСТЬNULL(ВТДаты.Период, ""Без договора"") КАК Дата,
		|	ВТКонтрагенты.Ссылка КАК Контрагент,
		|	ЕСТЬNULL(ВТДаты.Регистратор.Ссылка, ""Договор отсутствует"") КАК РегистраторСсылка
		|ИЗ
		|	ВТКонтрагенты КАК ВТКонтрагенты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДаты КАК ВТДаты
		|		ПО ВТКонтрагенты.Ссылка = ВТДаты.Контрагент
		|
		|УПОРЯДОЧИТЬ ПО
		|	АбонентскаяПлата,
		|	ВТКонтрагенты.Ссылка.Наименование";
	
	ЗапросДоговоров.Параметры.Вставить("Дата", КонецДня(Месяц));
	
	РезультатЗапросаДоговоров = ЗапросДоговоров.Выполнить();
	
	ВыборкаДоговоров = РезультатЗапросаДоговоров.Выбрать();
	
	СДоговором = 0;
	БезДоговора = 0;
	
	Пока ВыборкаДоговоров.Следующий() Цикл
		ОбластьСтрока.Параметры.Дата = Формат(ВыборкаДоговоров.Дата, "ДФ=дд.ММ.гггг");
		ОбластьСтрока.Параметры.Контрагент = ВыборкаДоговоров.Контрагент;
		ОбластьСтрока.Параметры.Абонент = ВыборкаДоговоров.АбонентскаяПлата;
		ОбластьСтрока.Параметры.Тариф = ВыборкаДоговоров.Тариф;
		ОбластьСтрока.Параметры.ТарифСверхурочный = ВыборкаДоговоров.ТарифСверхурочный;
		ОбластьСтрока.Параметры.Договор = ВыборкаДоговоров.РегистраторСсылка;
		
		//Если ВыборкаДоговоров.Тариф = 0 Тогда
		//	ОбластьСтрока.Параметры.НаличиеДоговора = Ложь;
		//	БезДоговора = БезДоговора + 1;
		//Иначе 
		//	ОбластьСтрока.Параметры.НаличиеДоговора = Истина;
		//	СДоговором = СДоговором + 1;
		//КонецЕсли;
		//
		//СУКА БЛЯДЬ НИКИТА!!!
		//Наличие договора нужно проверять по наличию ДОГОВОРА, а не сумме ТАРИФА
		Если ТипЗнч(ВыборкаДоговоров.РегистраторСсылка) = Тип("Строка") Тогда
			ОбластьСтрока.Параметры.НаличиеДоговора = Ложь;
			БезДоговора = БезДоговора + 1;
		Иначе 
			ОбластьСтрока.Параметры.НаличиеДоговора = Истина;
			СДоговором = СДоговором + 1;
		КонецЕсли;
		
		
		ТабДок.Вывести(ОбластьСтрока);
		Если ВыборкаДоговоров.Тариф = 0 Тогда
			Область= ТабДок.Область("R" + Строка(БезДоговора + СДоговором +4) + "C2:R" + Строка(БезДоговора + СДоговором + 4) + "C9");
			Область.ЦветФона = WebЦвета.БледноКрасноФиолетовый;
		КонецЕсли;
	КонецЦикла;
		
	ОбластьПодвал.Параметры.С = СДоговором;
	ОбластьПодвал.Параметры.Без = БезДоговора;
	ТабДок.Вывести(ОбластьПодвал);
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере(ЭтаФорма.Месяц);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Месяц = НачалоМесяца(ТекущаяДата());
КонецПроцедуры
